# LayerModifier Properties

---
The LayerModifier type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ModifierType|  The modifier type of LayerModifier.
| Separator|  The separator string that will follow this modifier in the export layer name.
Top
#### Reference
LayerModifier Class
Autodesk.Revit.DB Namespace